Repository: mozilla-l10n/mt-training-data
Catalog: ha/ha_pontoon.tmx
Source language: en_us
Languages: ha

source: How to contribute
ha: Yadda za'a bayar da gudun mawa

source: How To Contribute
ha: Yadda za ka bayarda Gudun mawa

source: How to download, manage and use your favorite apps on your Firefox OS phone.
ha: Yadda za ka ɗauka, tafiyarda da kuma amfani da aikace-aikacen da fi fi so a kan wayarka ta Firefox OS.

source: How to install and keep Firefox for Android up to date
ha: Yadda za'a saka kuma a ajiye Firefox domin Android cikin sabunta

source: How to install and keep Thunderbird up to date
ha: Yadda za ka saka kuma ka ajiye Thunderbird cikin sabunta

source: How to install Firefox and keep it up to date
ha: Yadda za ka saka Firefox kuma ka barta cikin sabuntawa

source: How to troubleshoot error messages on Firefox
ha: Yadda za'a yi maganin matsalar kuskuren saƙo a Firefox

source: How to use bookmarks, tabs and basic Firefox features on your iOS device
ha: Yadda za ka yi amfani da zaunanniyar alama, madannai da siffofi mahimmai na Firefox a kan na'urarka ta iOS

source: How to use Firefox's privacy and security features
ha: Yadda za ka yi amfani da siffofin sirrinka da kuma tsaro

source: How to use the address book on Thunderbird
ha: Yadda ake amfani da littafi adireshi a kan Thunderbird

source: I already have an account
ha: Tuni ina da asusu

source: I am providing the requested information
ha: Ina bayar da bayanin da aka nema

source: Identifying common problems helps the community answer your questions more quickly.
ha: Gano matsaloli game-gari na taimakawa ƙungiya amsa tambayoyinka cikin hanzari.

source: I didn't get a confirmation email.
ha: Ban sami imel na tabbatarwa ba.

source: I don't know
ha: Ban sani ba

source: If checked, this document allows discussion in an associated forum. Uncheck to hide/disable the forum.
ha: Idan an saka alama, wannan daftarin zai bar tattaunawa a dandali na haɗin-gwiwa. Cire alama domin ɓoye/kashe dandalin.

source: If checked, this document needs updates.
ha: Idan an saka alama, wannan daftari na bukatar sabuntawa.

source: If checked, this wiki page will be hidden from basic searches and dashboards. When viewed, the page will warn that it is no longer maintained.
ha: Idan an saka alama, wannan shafin na wiki za'a ɓoyeshi daga tushen bincike da allo. Lokacin kallo, shafin zai yi gargaɗi cewa ba'a kula da shi.

source: I forgot my username.
ha: Na manta suna na na mai amfani.

source: If the link above doesn’t work, click here:
ha: Idan haɗin bai yi aiki ba, danna nan:

source: If this answer solves your problem, please mark it as "solved":
ha: Idan wannan amsa ta warware matsalarka, yi mata alama a matsayin "an warware":

source: If this comment is helpful, vote on it:
ha: Idan wannan sharhin ya taimaka, yi zaɓe a kansa:

source: If this doesn't solve your problem, let {answerer} know by replying on the website:
ha: Idan wannan bai warware matsalarka ba, bari {answerer} ya sani ta bayar ba da amsa a kan yanar gizo:

source: If you are interested in learning more about how this whole support thing works, check out our <a href="%(training_url)s"> contributor training </a>. This includes some cool troubleshooting info, guidelines, how-to questions, and info about where to find more help if stuck.
ha: Idan ka na da sha'awar daɗa koyon yadda duk wannan abin ya ke aiki, duba <a href="%(training_url)s"> horo na masu bayar da gudun mawa </a>. Wannan ya haɗa da bayanai masu ban sha'awa na warware matsala, jogora, tambayoyin yaya-za'ayi-kaza, da bayanai dangane da inda za'a sami ƙarin taimako idan an sami matsala.

source: If you are interested in learning more about how this whole support thing works, check out our contributor training. This includes some cool troubleshooting info, guidelines, how-to questions, and info about where to find more help if stuck.
ha: Idan ka na da sha'awa ta ci gaba da koyo dangane da yadda duk wannan tallafi ya ke aiki, duba wajen horo na masu bayar da gudun mawarmu. Wannan ya haɗa da bayanai masu gamsarwa na warware matsala, bayanai na jagoranci, tambayoyi na yaya-za'a-yi-kaza, da bayani dangane da inda za'a sami ƙarin taimako idan abu ya gagara.

source: If you did not request this email there is no need for further action.
ha: Idan ba ka nemi wannan imel ba babu bukatar wani mataki a gaba.

source: If you did not request this email, there is no need for further action.
ha: Idan ba ka nemi wannan imel ba, babu bukatar ɗaukar wani mataki.

source: If you have a moment please help us by reviewing these articles:
ha: Idan ka sami lokaci taimaka mana ta hanyar nazarin waɗan nan maƙaloli:

source: If you have a moment please review these articles:
ha: Idan za ka sami lokaci muna fata za ka yi nazarin waɗan nan rubuce-rubuce:

source: If you have any questions about localization priorities, please contact %(email_link)s.
ha: Idan ka na da wasu tambayoyi dangane da bukatunka na fassara, tuntuɓi %(email_link)s.

source: If you know what you are doing, you can edit the document anyway.
ha: Idan ka san me ka ke yi, za ka iya gyara daftarin duk da haka.

source: If you like writing and teaching then the Knowledge Base is the place for you. We need contributors that can write, edit or proof read articles in English. Thousands of people are accessing our Knowledge Base every week. Imagine how many will be helped by you!
ha: Idan kana son rubutu da koyarwa to Tushen Ilimi shi ne wurinka. Muna bukatar masu bayar da gudun mawa waɗanda za su iya rubutu, gyara ko bibiyar maƙaloli a turanci. Dubban mutane su na samun dama da Tushenmu na Ilimi a duk mako. Ka yi tunanin nawa ne za su sami taimako daga wurinka!

source: If you need help with Firefox, please <a href="%(aaq_url)s">ask a question</a>.
ha: Idan kana bukatar taimako da Firefox, <a href="%(aaq_url)s">ask a question</a>.

source: If you submit information to Mozilla when you crash, you'll be given a crash ID which uniquely identifies your crash and lets us look at details that may help identify the cause. To find your recently submitted crash IDs, go to <strong>about:crashes</strong> in your location bar. <a href='http://support.mozilla.com/en-US/kb/Firefox+crashes#Getting_the_most_accurate_help_with_your_Firefox_crash' target='_blank'>Click for detailed instructions</a>.
ha: Idan ka aika da bayani zuwa Mozilla idan ka sami karo, za'a ba ka ID na karo wanda kai kaɗai zai tantance kuma ya bamu dama mu ga cikakken bayani wanda zai taimaka wajen gano dalili. Domin gano aikawa da karon ID na kwana-kwanan nan jeka <strong>about:crashes</strong> in your location bar. <a href='http://support.mozilla.com/en-US/kb/Firefox+crashes#Getting_the_most_accurate_help_with_your_Firefox_crash' target='_blank'>Click for detailed instructions</a>.

source: Ignore
ha: Yi watsi

source: Ignored Users
ha: Masu amfani da aka watsar

source: Ignore User
ha: Yi watsi da Mai amfani

source: I have feedback about Firefox
ha: Ina da amsa dangane da Firefox

source: I have this problem, too
ha: Nima, ina da wannan matsalar

source: Image
ha: Hoto

source: Image:
ha: Hoto:

source: Image Attachment
ha: Abin maƙalawa na hoto

source: Images
ha: Hotuna

source: Image too large. Please select a smaller image file.
ha: Hoto ya yi girma sosai. Zaɓi ƙaramin fayil na hotuna.

source: Immediate Update Needed
ha: Ana bukatar Sabuntawa nan take

source: Import settings from other browsers
ha: Shigo da saituna daga wasu masu gewayawa

source: Improve our help articles
ha: Inganta maƙalolinmu na taimako

source: Inbox
ha: Cikin akwati

source: Include obsolete articles?
ha: A haɗa da maƙaloli tsahon yayi?

source: Include this in wiki syntax with [[Image:title]]
ha: Haɗa da wannan ginin kalma na wiki da [[Image:title]]

source: In English
ha: A Turanci

source: In order to prevent spam, we are limiting the number of answers that can be posted within a short period of time. If you want to post more please create a post on the <a href="%(url)s">contributors forum</a> requesting that you be white-listed.
ha: Domin kariya daga wasiƙa gayyar-soɗi, muna taƙaita adadin amsoshin da za'a iya aikawa cikin gajeren lokaci. Idan kana so ka daɗa aike ƙirƙiri aike a <a href="%(url)s">contributors forum</a> ka tambayi cewa kana so ka shiga farin-jeri.

source: Insert a link...
ha: Saka haɗi...

source: Insert Link
ha: Shigar da Haɗi

source: Insert media...
ha: Shigar da kiɗa...

source: Insert Media
ha: Saka Kiɗa

source: Insert Response
ha: Saka Amsa

source: Install and keep Firefox up to date on your iPad, iPhone or iPod Touch.
ha: Saka da ajiye Firefox cikin sabunta a kan iPad ta ka, iPhone ko iPod Touch.

source: Install and update
ha: Saka kuma ka sabunta

source: Install and Update
ha: Saka da Sabuntawa

source: Installation Issues
ha: Batutuwan Sakawa

source: Installed plugins
ha: Saka haɗawa

source: Installed Plug-ins
ha: Haɗawar da aka saka

source: Install, Migrate and Update
ha: Saka, Yi Ƙaura kuma ka Sabunta

source: Install open apps from the Marketplace to add more fun and functionality to your device
ha: Saka buɗaɗɗun aikace-aikace daga Marketplace domin daɗa nisahɗi da ayyuka zuwa ga na'urarka

source: Internet and Connections
ha: Intanet da Haɗe-haɗe

source: Interval
ha: Tazara

source: Introduce yourself
ha: Gabatar da kanka

source: Intro to Open Badges
ha: Gabatrwa zuwa Buɗaɗɗun Bajuna

source: Invalid callback function.
ha: Aikin kiran-baya marar inganci.

source: Invalid field
ha: Sarari marar indanci

source: Invalid ID.
ha: ID maras inganci.

source: Invalid image. Please select a valid image file.
ha: Hoto mara inganci. Zaɓi ingantaccen fayil na hoto.

source: Invalid or no image received.
ha: Marar inganci ko ba'a karɓi hoto ba.

source: Invalid search data.
ha: Bayanin nema marar inganci.

source: Invalid tag entered: %s
ha: An shigar da shaida marar inganci: %s

source: Invalid username provided. Enter a new username below.
ha: An bayar da sunan mai amfani wanda ba dai dai ba. Shigar da sabon sunan mai amfani a ƙasa.

source: IRC nickname
ha: Sunan barkwanci na IRC

source: Is approved?
ha: An amince?

source: Is current revision?
ha: Nazari ne na yanzu?

source: Issue Badges
ha: Bayar da Bajuna

source: Issue digital badges to acknowledge new skills and achievements
ha: Bayar da bajuna ta hanyar kwamfuta domin godiya ga sabuwar ƙwarewa da koyo

source: Issued on:
ha: Bayarwa a:

source: Issue submitted successfully
ha: An miƙa batun cikin nasara

source: Italic
ha: Shagiɗaɗɗe

source: italic text
ha: shagiɗaɗɗen rubutu

source: It looks like you've bookmarked an old URL. The new URL for this page is below. You should update your bookmarks. We will forward you to the new URL in 10 seconds.
ha: Bisa ga dukkan alamu an saka maka zaunanniyar alama a tsohon URL. Sabon URL na wannan shafi ya na ƙasa. Ya kamata ka sabunta zaunanniyar alamarka. Zamu miƙaka zuwa sabon URL a cikin daƙiƙa 10.

source: It seems your account has already been activated.
ha: Bisa ga dukkan alamu an farfaɗo da asusunka.

source: It's fun and addictive and the Awesome is you!
ha: Yana da sa annashuwa kuma da shiga rai kuma Burgewar ita ce kai!

source: I understand, don't show this again.
ha: Na fahimta, ka da a sake nuna min wannan.

source: Join our Army of Awesome
ha: Shiga Rundunarmu ta Burgewa

source: Jump to:
ha: Tsallaka zuwa:

source: Just edit articles in your language!
ha: Kawai gyara maƙaloli a cikin yarenka!

source: Just once or twice
ha: Sau ɗaya ko biyu

source: KB Dashboard
ha: Allon KB

source: KB Editor - Help to update knowledge base articles that need changes or write new articles:
ha: Mai gyara na KB - Taimaka wajen sabunta maƙalolin tushen ilimi waɗanda ke bukatar canje-canje ko ka rubuta sabuwar maƙala:

source: KB Team
ha: Ƙungiyar KB

source: Keep in touch with your contacts through email and messaging.
ha: Zama cikin haɗi da abokan hulɗarka ta hanyar imel da saƙwanni.

source: Keep your information safe with Firefox for Android's privacy and security settings.
ha: Ajiye bayananka cikin tsaro tare da saituna na ƙashin kai da kuma tsaro na Firefox domin Android.

source: Keep your information safe with Firefox OS locks, privacy features and more.
ha: Ajiya bayananka cikin tsaro tare da makullai na Firefox OS, siffofi na ƙashin kai da sauransu.

source: Keep your information safe with password and security settings
ha: Ajiye bayananka cikin sirri tare da kalmar wucewarka da saitunan tsaro

source: Keywords:
ha: Mahimman kalmomi:

source: Keywords in {locale}:
ha: Mahimman kalmomi a {locale}:

source: Kitsune Contributor
ha: Mai bayar da gudun mawa na Kitsune

source: Knowledge Base
ha: Tushen Ilimi

source: Knowledge Base Article
ha: Maƙala Mai Tushen Ilimi

source: Knowledge Base Dashboard
ha: Allo Mai Tushen Ilimi

source: KPI Dashboard
ha: Allon KPI

source: L10N Contributor - Help to translate Firefox Help content to your language:
ha: Mai bayar da Gundun mawa - Zai taimaka wajen fassara abubuwan ciki na Taimakon Firefox zuwa yarenka:

source: L10n coverage
ha: Isarwa ta L10n

source: L10n Coverage
ha: Isarwa ta L10n

source: <label>Needs Change:</label> %(comment)s
ha: <label>Yana bukatar Canji:</label> %(comment)s

source: Last 30 days
ha: Kwanaki 30 da suka wuce

source: Last 7 days
ha: Kwanaki 7 da suka wuce

source: Last 90 days
ha: Kwanaki 90 da suka wuce

source: Last answer date
ha: Kwanan watan amsar ƙarshe

source: Last Post
ha: Aiken ƙarshe

source: Last post date
ha: Kwanan watan aike na ƙarshe

source: Last reply by
ha: Amsa ta ƙarshe daga

source: Last reply by {user}
ha: Amsa ta ƙarshe daga {user}

source: Last updated:
ha: Sabuntawar ƙarshe:

source: Last updated by:
ha: Sabuntawar ƙarshe daga:

source: Last Week
ha: Makon da ya Gabata

source: Learn all about Thunderbird controls and functionality.
ha: Yi koyo dangane da abubuwan tafiyarwa na Thunderbird da ayyukanta.

source: Learn all you need to know to get Firefox for Android up and running.
ha: Koyi duk abubuwan da ka ke bukata ka sani domin samun Firefox domin Android da gudanarwa.

source: Learn all you need to know to get started with Firefox.
ha: Koyi duk abin da ka ke so ka sani domin farawa da Firefox.

source: Learn how to add and manage contacts, as well as make one-to-one or conference calls on your Firefox OS phone.
ha: Koyi yadda zaka daɗa ko tafiyar da abokan hulɗa, da kuma kira daga wannan zuwa wancan ko kuma taro a kan wayarka ta Firefox OS.

source: Learn how to change your toolbar, font sizes and browser colors
ha: Koyi yadda zaka canja saɗararka ta kayan aiki, girman runutu da kuna launin mai gewayawa

source: Learn how to configure the Internet connection, display and time on your Firefox OS device.
ha: Koyi yadda za ka saita haɗin intanet, nuni da lokaci a na'urarka ta Firefox OS.

source: Learn how to create and share your own webpages quickly and easily.
ha: Koyi yadda za ka ƙirƙira kuma ka raba shafukanka na yanar gizo cikin sauri da sauƙi.

source: Learn how to create, assess and issue badges
ha: Koyi yadda za ka ƙirƙiri, tantance da kuma yadda za ka bayar da bajuna

source: Learn how to download Firefox on your desktop devices or move information to and from other browsers.
ha: Koyi yadda za ka sauke Firefox a kan na'urarka ta kwamfuta ko ka matsar da bayani daga sauran masu gewayawa.

source: Learn how to fix problems with Gmail, Yahoo and other email providers
ha: Koyi yadda za ka yi maganin matsala tare da Gmail, Yahoo da sauran masu bayar da imel

source: Learn how to import or export your information between Firefox and another browser
ha: Koyi yadda za ka shigar ko ka fitar da bayani tsakanin Firefox da wata mai gewayawa

source: Learn how to inspect the code behind every webpage.
ha: Koyi yadda za ka duba lamba da ke bayan ko wace tashar yanar gizo.

source: Learn how to install and transfer information to Firefox for Android.
ha: Koyi yadda za ka saka kuma ka yi canjin bayani zuwa Firefox domin Android.

source: Learn how to keep your information safe and secure with Firefox's private browsing, password features and other security settings.
ha: Koyi yadda za ka ajiye bayananka lafiya da tsaro tare da mai gewayawa ta ƙashin kai ta Firefox, siffofin kalmar wucewa da sauran saitunan tsaro.

source: Learn how to manage your email messages
ha: Koyi yadda za ka tafiyar da saƙwanninka na imel

source: Learn how to remix web video, audio and images into mashups that you can embed on other websites.
ha: Koyi yadda za ka sake haɗa bidiyo na ka yanar gizo, abin saurare da hotuna zuwa waƙa hatsin-bara da aka harhaɗo daga sauran dandalin yanar gizo.

source: Learn how to troubleshoot issues on your Firefox OS phone.
ha: Koyi yadda za ka magance matsaloli a kan wayarka ta Firefox OS.

source: Learn how to view content on another screen
ha: Koyi yadda za ka ga abin da ke ciki akan wani fuskar kwamfuta

source: Learn more about Mozilla's privacy and security practices.
ha: Daɗa koyo dangane da ayyukan sirri da tsaro na Mozilla.

source: Learn more about Wi-Fi, Bluetooth and NFC connections.
ha: Daɗa koyo dangane da Wi-Fi, Bluetooth da haɗa-haɗen NFC.

source: Learn new things
ha: Koyi sababbin abubuwa

source: Learn the basic about Open Badges
ha: Koyi tushe dangane da Buɗaɗɗun Bajuna

source: Learn the basic functionality for your Firefox OS phone.
ha: Koyi ginshiƙan ayyuka domin wayarka ta Firefox OS.

source: Learn the Basics: get started
ha: Koyi na Asali: Fara

source: Learn the Basics. Get Started
ha: Koyi tushe. Fara

source: Learn tips and shortcuts to help you work faster
ha: Koyi shawarwari da gajerun hanyoyi domin taimaka maka aiki cikin hanzari

source: Learn to find and install open apps to add more fun and functionality to your device
ha: Koyi yadda zaka nema kuma ka saka aikce-aikace domin ƙara nishaɗi zuwa na'urarka

source: Learn to set up accounts, read, send and manage emails
ha: Koyi yadda za ka saita asusu, karanta, aika da kuma tafiyar da saƙwannin imel

source: Leave a message for {contributor}:
ha: Bar saƙo ga {contributor}:

source: Leave a message for {rest} and {last}:
ha: Bar saƙo domin {rest} da {last}:

source: Legal Notices
ha: Bayanan Shari'a

source: Less than
ha: Ƙasa da

source: Let's make Mozilla Support speak your language!
ha: Bari mu bar Tallafi na Mozilla ya yi magana da yarenka!

source: Let us know which of the above you would be interested in and we’ll help you get started. It’s great to have you onboard!
ha: Bari mu sani wanne daga cikin abubuwan sama ka ke da sha'awa kuma za mu taimaka maka ka fara. Yana da mahimmanci mu sameka a ciki!

source: Limited Data
ha: Bayanin Taƙaita

source: Link target:
ha: Inda haɗi ya nufa:

source: link text
ha: haɗin rubutu

source: Link text:
ha: Haɗin rubutu:

source: Link to this post.
ha: Haɗi zuwa wannan aiken.

source: Live
ha: Na yanzu

source: {l} Knowledge Base Discussions
ha: {l} Tattaunawa ta Asalin Ilimi

source: Locale
ha: Wuri

source: Locale:
ha: Wuri:

source: Locale Editors
ha: Masu gyara na wuri

source: [{locale}] KB Team
ha: [{locale}] Ƙungiyar KB

source: Locale Leaders
ha: Shugabannin Wuri

source: [{locale}] Locale Metrics
ha: [{locale}] Lambobin Wuri

source: [{locale}] Localization Team
ha: [{locale}] Ƙungiyar Fassara

source: Locale Metrics
ha: Lambobin Wuri

source: {locale_name} Discussions
ha: {locale_name} Tattaunawa

source: {locale_name} Discussions | Knowledge Base
ha: {locale_name} Tattaunawa | Tushen Ilimi

source: [{locale}][{product}] Localization Dashboard
ha: [{locale}][{product}] Allon Fassara

source: Locale Reviewers
ha: Mazu Nazari na Wuri

source: Locales
ha: Wurare

source: Locales | Knowledge Base
ha: Wurare | Tushen Ilimi

source: {locale} translation:
ha: fassarar {locale}:

source: Localization Dashboard
ha: Allon Fassara

source: Localization Metrics
ha: Lambar Fassarawa

source: Localization Percentage
ha: Kaso daga cikin ɗari na fassara

source: Localization status of all canned responses
ha: Matsayin fassara na duk shiryayyun amsoshi

source: Localization Team
ha: Ƙungiyar masu Fassara

source: Localize the document
ha: Fassara daftarin

source: Locked
ha: An rufe

source: Lock this question
ha: Kulle wannan tambaya

source: Lock this thread
ha: Kulle wannan tattaunawa

source: Logged in!
ha: An shiga!

source: Logging in...
ha: Shiga...

source: Log in
ha: Shiga

source: Login Problems?
ha: Matsalolin Shiga?

source: Log In / Register
ha: Shiga / Rijista

source: Log in, so you can respond to your question when it is answered:
ha: Shiga, yadda za ka amsa zuwa tambayarka idan an amsa:

source: Log in to an existing account
ha: Shiga zuwa asusu na yanzu

source: Look at the top of your screen, and click the menu item called <em>Edit</em>.
ha: Duba saman fuskar kwamfutarka, sannan ka danna jerin bayanin da ake kira <em>Edit</em>.

source: Look at the top of your screen, and click the menu item called <em>Help</em>.
ha: Duba samun allon kwamfutarka, kuma ka danna jerin abin da ake kira <em>Help</em>.

source: Love Firefox and have a few moments to help?<br /> Help other Firefox users on Twitter. Good things will come to those who tweet!
ha: Ka na ƙaunar Firefox kuma ka na wani ɗan lokaci na taimakawa?<br /> Taimakawa sauran masu amfani da Firefox a Twitter. Kyawawan abubuwa na zuwa ga waɗanda ke tweet!

source: Love Firefox? Love Twitter?
ha: Kana son Firefox? Kana son Twitter?

source: Maintenance in progress
ha: Ana yin gyara

source: Major content changes that will make older translations inaccurate
ha: Manya-manyan canje-canjen abin ciki waɗanda za su mayar da tsofaffin fassarori ba dai dai ba

source: Make Firefox for Android work the way you want through customization.
ha: Mayar da Firefox domin Android ta yi aiki yadda ka ke so ta hanyar tsarawa.

source: Make Firefox for Android yours with these customization options
ha: Mayar da Firefox domin Android ta zama taka tare da waɗan nan zaɓi na tsarawa

source: Make Firefox yours by adding and managing the features that you want.
ha: Mayar da Firefox ta zama taka ta daɗa da kuma tafiyar da siffofi waɗanda ka ke so.

source: Make Firefox yours through customization settings and add-ons
ha: Mayar da Firefox ta zama taka ta hanyar saitunan tsarawa da daɗawa

source: Make my email public
ha: Mayar da imel ɗin ka domin jama'a

source: Make privacy a key factor in selecting and interacting with partners.
ha: Mayar da sirri ya zama jigo na zaɓi da hulɗa da abokan cuɗanya.

source: Malware
ha: Gubar kwamfuta

source: Manage add-ons
ha: Tafiyar da daɗe-daɗe

source: Manage preferences and add-ons
ha: Tafiyar da abubuwan da aka fi so da na daɗawa

source: Manage watch list
ha: Tafiyar da wane jeri

source: Many thanks for your contribution in behalf of SUMO and the happy users who get help!
ha: Godiya mai yawa sabo da gudun mawarka a maimakon SUMO kuma masu amfani da suka yi farin ciki waɗanda suka sami taimako!

source: Many thanks for your contribution on behalf of SUMO and the happy users who are helped by your work!
ha: Godiya mai yawa domin gudun mawarka maimakon SUMO da kuma masu amfanin da suka yi farin ciki sabo da aikinka!

source: Mark as Ready for Localization
ha: Yi alama a matsayin Shiryawa domin Fassara

source: Mark as spam
ha: Yi alama a matsayin wasiƙa gayyar-soɗi

source: Marked as spam
ha: An yi alama a matsayin wasiƙa gayyar-soɗi

source: Marked as spam by %(marked_by)s at %(marked_time)s
ha: An yi alama a matsayin damfara daga %(marked_by)s a %(marked_time)s

source: Marketplace: Developer Support Request
ha: Marketplace: Neman Tallafi na Mai haɓakawa

source: Marketplace: Request a Refund
ha: Marketplace: Nemi Maido da kuɗi

source: Mark it as solved
ha: Yi masa alama a matsayin an warware

source: Mark read
ha: Yi alama an karanta

source: Mark Selected as Read
ha: Yiwa waɗanda aka zaɓa alamar an karanta

source: Mark unread
ha: Yi alama ba'a karanta ba

source: Matching responses
ha: Amsoshi da suka dace

source: media
ha: kiɗa

source: Media Gallery
ha: Ma'ajiyar Kaɗe-kaɗe

source: Media Gallery Search
ha: Bincike na Ma'ajiyar Hotuna

source: Message:
ha: Saƙo:
